def latin_to_cyrillic(text, language='ru'):
    if language == 'ru':
        latin_to_cyrillic_map = { 
        'a': 'ф', 'b': 'и', 'c': 'с', 'd': 'в', 'e': 'у', 'f': 'а',
        'g': 'п', 'h': 'р', 'i': 'ш', 'j': 'о', 'k': 'л', 'l': 'д',
        'm': 'ь', 'n': 'т', 'o': 'щ', 'p': 'з', 'q': 'й', 'r': 'к',
        's': 'ы', 't': 'е', 'u': 'г', 'v': 'м', 'w': 'ц', 'x': 'ч',
        'y': 'н', 'z': 'я', 'A': 'Ф', 'B': 'И', 'C': 'С', 'D': 'В',
        'E': 'У', 'F': 'А', 'G': 'П', 'H': 'Р', 'I': 'Ш', 'J': 'О',
        'K': 'Л', 'L': 'Д', 'M': 'Ь', 'N': 'Т', 'O': 'Щ', 'P': 'З',
        'Q': 'Й', 'R': 'К', 'S': 'Ы', 'T': 'Е', 'U': 'Г', 'V': 'М',
        'W': 'Ц', 'X': 'Ч', 'Y': 'Н', 'Z': 'Я', ';': 'ж', ':': 'Ж', 
        ',': 'б', '<': 'Б', '.': 'ю', ">": "Ю", "'": 'э', '"': "Є",
        '/': '.', '?': ',', ']': 'ъ', '}': 'Ъ', '[': 'х', '{': 'Х',
        '@': '"', '№': ';', '^': ':', '&': '?', 
    }
    elif language == 'ua':
        latin_to_cyrillic_map = {
        'a': 'ф', 'b': 'и', 'c': 'с', 'd': 'в', 'e': 'у', 'f': 'а',
        'g': 'п', 'h': 'р', 'i': 'ш', 'j': 'о', 'k': 'л', 'l': 'д',
        'm': 'ь', 'n': 'т', 'o': 'щ', 'p': 'з', 'q': 'й', 'r': 'к',
        's': 'і', 't': 'е', 'u': 'г', 'v': 'м', 'w': 'ц', 'x': 'ч',
        'y': 'н', 'z': 'я', 'A': 'Ф', 'B': 'И', 'C': 'С', 'D': 'В',
        'E': 'У', 'F': 'А', 'G': 'П', 'H': 'Р', 'I': 'Ш', 'J': 'О',
        'K': 'Л', 'L': 'Д', 'M': 'Ь', 'N': 'Т', 'O': 'Щ', 'P': 'З',
        'Q': 'Й', 'R': 'К', 'S': 'І', 'T': 'Е', 'U': 'Г', 'V': 'М',
        'W': 'Ц', 'X': 'Ч', 'Y': 'Н', 'Z': 'Я', ';': 'ж', ':': 'Ж', 
        ',': 'б', '<': 'Б', '.': 'ю', ">": "Ю", "'": 'є', '"': "Є",
        '/': '.', '?': ',', ']': 'ї', '}': 'Ї', '[': 'х', '{': 'Х',
        '@': '"', '№': ';', '^': ':', '&': '?', "\\": 'ґ', '|': 'Ґ',
        }
    translation_table = str.maketrans(latin_to_cyrillic_map)
    return text.translate(translation_table)